#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main()
{
	int a1 = 3;
	float a2 = 2.0;
	printf("a1/a2  = %f", a1 * 1.5);


	//int a3 = 1, a4;
	//int a5 = 1, a6 = 2;
}

/*
변수 정수형, 실수형
정수 끼리 연산하면 정수 
/ :나누기 몫값
% :나누기 나머지 값


정수, 실수 하나라도 포함 실수나옴

실수형이니까 %f 로 나옴
* 
* 
* 
프로그램은 위에서 아래순으로 흐름 

main이 Test.obj에 이미 정의되어 있습니다.
C언어는 main을 찾는 다.

그래서 main 2개라 

우클릭 test.c 속성 빌드에서 제외 "예"선택
그럼 에러 발생하지 않음

문법은 차이 나지만 기능은 대동소이함.
절차 지향 언어 요즘 잘 안씀 객체지향 씀

절차지향 언어를 배우고 객체지향 배우면 어려울 수 있음

허나, 그 단계 넘어서면 상관없음 

C언어가 공부하기 좋음

포인터 주소 쫒아가면댐
----------------------------
타입 한정자라는 게 있음

항상 같은 값 변하지 않은 값 

상수는 값을 바꿀 수 없다는 장점 있음




*/